jmeter/test_medium/02/log_02.log
(base) lucia@lucia-HP-Laptop-15-dw0xxx:/opt/jmeter/bin$ jmeter -n -t /home/lucia/Documenti/GitHub/cloud-computing-project/jmeter/aws_flask.jmx -l /home/lucia/Documenti/GitHub/cloud-computing-project/jmeter/test_medium/02/log_02.csv -e -o /home/lucia/Documenti/GitHub/cloud-computing-project/jmeter/test_medium/02/dashboard
Creating summariser <summary>
Created the tree successfully using /home/lucia/Documenti/GitHub/cloud-computing-project/jmeter/aws_flask.jmx
Starting standalone test @ 2023 May 27 18:16:53 CEST (1685204213662)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
Warning: Nashorn engine is planned to be removed from a future JDK release
summary +      6 in 00:00:36 =    0.2/s Avg:  3856 Min:   254 Max:  8366 Err:     0 (0.00%) Active: 2 Started: 2 Finished: 0
summary +     26 in 00:01:01 =    0.4/s Avg:  6786 Min:   216 Max: 22685 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
summary =     32 in 00:01:37 =    0.3/s Avg:  6237 Min:   216 Max: 22685 Err:     0 (0.00%)
summary +     17 in 00:00:29 =    0.6/s Avg:  7708 Min:   303 Max: 25755 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
summary =     49 in 00:02:06 =    0.4/s Avg:  6747 Min:   216 Max: 25755 Err:     0 (0.00%)
summary +     11 in 00:00:30 =    0.4/s Avg: 12452 Min:   303 Max: 29073 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
summary =     60 in 00:02:37 =    0.4/s Avg:  7793 Min:   216 Max: 29073 Err:     0 (0.00%)
summary +     14 in 00:00:32 =    0.4/s Avg:  8560 Min:   299 Max: 23083 Err:     0 (0.00%) Active: 5 Started: 5 Finished: 0
summary =     74 in 00:03:09 =    0.4/s Avg:  7938 Min:   216 Max: 29073 Err:     0 (0.00%)
summary +     13 in 00:00:27 =    0.5/s Avg: 10374 Min:   317 Max: 30679 Err:     0 (0.00%) Active: 8 Started: 8 Finished: 0
summary =     87 in 00:03:36 =    0.4/s Avg:  8302 Min:   216 Max: 30679 Err:     0 (0.00%)
summary +     14 in 00:00:30 =    0.5/s Avg:  7304 Min:   167 Max: 32640 Err:     2 (14.29%) Active: 10 Started: 10 Finished: 0
summary =    101 in 00:04:06 =    0.4/s Avg:  8164 Min:   167 Max: 32640 Err:     2 (1.98%)
summary +     36 in 00:00:32 =    1.1/s Avg:  8706 Min:   118 Max: 40622 Err:    19 (52.78%) Active: 10 Started: 10 Finished: 0
summary =    137 in 00:04:38 =    0.5/s Avg:  8306 Min:   118 Max: 40622 Err:    21 (15.33%)
summary +     21 in 00:00:28 =    0.7/s Avg:  7928 Min:   140 Max: 38131 Err:    14 (66.67%) Active: 10 Started: 10 Finished: 0
summary =    158 in 00:05:06 =    0.5/s Avg:  8256 Min:   118 Max: 40622 Err:    35 (22.15%)
summary +     37 in 00:00:30 =    1.2/s Avg:  7264 Min:   106 Max: 42266 Err:    26 (70.27%) Active: 10 Started: 10 Finished: 0
summary =    195 in 00:05:36 =    0.6/s Avg:  8068 Min:   106 Max: 42266 Err:    61 (31.28%)
summary +     53 in 00:00:30 =    1.8/s Avg:  6351 Min:   108 Max: 43099 Err:    33 (62.26%) Active: 10 Started: 10 Finished: 0
summary =    248 in 00:06:06 =    0.7/s Avg:  7701 Min:   106 Max: 43099 Err:    94 (37.90%)
summary +     41 in 00:00:30 =    1.3/s Avg:  2553 Min:   107 Max: 25312 Err:    19 (46.34%) Active: 13 Started: 13 Finished: 0
summary =    289 in 00:06:36 =    0.7/s Avg:  6970 Min:   106 Max: 43099 Err:   113 (39.10%)
summary +     39 in 00:00:33 =    1.2/s Avg:  8992 Min:   305 Max: 31725 Err:     0 (0.00%) Active: 15 Started: 15 Finished: 0
summary =    328 in 00:07:10 =    0.8/s Avg:  7211 Min:   106 Max: 43099 Err:   113 (34.45%)
summary +     26 in 00:00:28 =    0.9/s Avg: 13241 Min:   215 Max: 45379 Err:     0 (0.00%) Active: 15 Started: 15 Finished: 0
summary =    354 in 00:07:38 =    0.8/s Avg:  7654 Min:   106 Max: 45379 Err:   113 (31.92%)
summary +     28 in 00:00:30 =    0.9/s Avg: 11878 Min:   304 Max: 41309 Err:     0 (0.00%) Active: 15 Started: 15 Finished: 0
summary =    382 in 00:08:08 =    0.8/s Avg:  7963 Min:   106 Max: 45379 Err:   113 (29.58%)
summary +     56 in 00:00:28 =    2.0/s Avg:  8689 Min:   108 Max: 39467 Err:    13 (23.21%) Active: 15 Started: 15 Finished: 0
summary =    438 in 00:08:36 =    0.8/s Avg:  8056 Min:   106 Max: 45379 Err:   126 (28.77%)
summary +     47 in 00:00:30 =    1.6/s Avg:  5646 Min:   105 Max: 35365 Err:    19 (40.43%) Active: 15 Started: 15 Finished: 0
summary =    485 in 00:09:06 =    0.9/s Avg:  7823 Min:   105 Max: 45379 Err:   145 (29.90%)
summary +     42 in 00:00:30 =    1.4/s Avg:  7092 Min:   110 Max: 45549 Err:    18 (42.86%) Active: 18 Started: 18 Finished: 0
summary =    527 in 00:09:36 =    0.9/s Avg:  7764 Min:   105 Max: 45549 Err:   163 (30.93%)
summary +     60 in 00:00:31 =    2.0/s Avg:  8863 Min:   111 Max: 53188 Err:    25 (41.67%) Active: 20 Started: 20 Finished: 0
summary =    587 in 00:10:07 =    1.0/s Avg:  7877 Min:   105 Max: 53188 Err:   188 (32.03%)
summary +     52 in 00:00:29 =    1.8/s Avg:  8824 Min:   120 Max: 44062 Err:    10 (19.23%) Active: 20 Started: 20 Finished: 0
summary =    639 in 00:10:36 =    1.0/s Avg:  7954 Min:   105 Max: 53188 Err:   198 (30.99%)
summary +     62 in 00:00:31 =    2.0/s Avg:  8529 Min:   215 Max: 44384 Err:     0 (0.00%) Active: 20 Started: 20 Finished: 0
summary =    701 in 00:11:07 =    1.1/s Avg:  8005 Min:   105 Max: 53188 Err:   198 (28.25%)
summary +     40 in 00:00:29 =    1.4/s Avg:  8223 Min:   215 Max: 52674 Err:     0 (0.00%) Active: 20 Started: 20 Finished: 0
summary =    741 in 00:11:36 =    1.1/s Avg:  8016 Min:   105 Max: 53188 Err:   198 (26.72%)
summary +     72 in 00:00:31 =    2.3/s Avg: 11698 Min:   106 Max: 60333 Err:    28 (38.89%) Active: 20 Started: 20 Finished: 0
summary =    813 in 00:12:07 =    1.1/s Avg:  8342 Min:   105 Max: 60333 Err:   226 (27.80%)
summary +     38 in 00:00:29 =    1.3/s Avg:  5508 Min:   109 Max: 24949 Err:    10 (26.32%) Active: 23 Started: 23 Finished: 0
summary =    851 in 00:12:36 =    1.1/s Avg:  8216 Min:   105 Max: 60333 Err:   236 (27.73%)
summary +     51 in 00:00:36 =    1.4/s Avg: 10485 Min:   148 Max: 60308 Err:     9 (17.65%) Active: 25 Started: 25 Finished: 0
summary =    902 in 00:13:12 =    1.1/s Avg:  8344 Min:   105 Max: 60333 Err:   245 (27.16%)
summary +     82 in 00:00:25 =    3.3/s Avg: 11735 Min:   107 Max: 60284 Err:    39 (47.56%) Active: 25 Started: 25 Finished: 0
summary =    984 in 00:13:37 =    1.2/s Avg:  8627 Min:   105 Max: 60333 Err:   284 (28.86%)
summary +     34 in 00:00:31 =    1.1/s Avg:  7827 Min:   135 Max: 35150 Err:    12 (35.29%) Active: 25 Started: 25 Finished: 0
summary =   1018 in 00:14:08 =    1.2/s Avg:  8600 Min:   105 Max: 60333 Err:   296 (29.08%)
summary +     23 in 00:00:29 =    0.8/s Avg: 30771 Min:   106 Max: 60365 Err:     9 (39.13%) Active: 11 Started: 25 Finished: 14
summary =   1041 in 00:14:37 =    1.2/s Avg:  9090 Min:   105 Max: 60365 Err:   305 (29.30%)
summary +      9 in 00:00:34 =    0.3/s Avg: 60225 Min: 60110 Max: 60422 Err:     9 (100.00%) Active: 2 Started: 25 Finished: 23
summary =   1050 in 00:15:11 =    1.2/s Avg:  9528 Min:   105 Max: 60422 Err:   314 (29.90%)
summary +      1 in 00:00:01 =    0.7/s Avg: 60301 Min: 60301 Max: 60301 Err:     1 (100.00%) Active: 0 Started: 25 Finished: 25
summary =   1051 in 00:15:12 =    1.2/s Avg:  9576 Min:   105 Max: 60422 Err:   315 (29.97%)
Tidying up ...    @ 2023 May 27 18:32:06 CEST (1685205126188)
... end of run
(base) lucia@lucia-HP-Laptop-15-dw0xxx:/opt/jmeter/bin$